{
  "medicalExamples": [
    {
      "id": 1,
      "name": "Kejang Demam",
      "description": "Kejang pada anak yang dipicu oleh demam",
      "example": "Berdasarkan Anamnesis, gejala akut yang menyertai demam tinggi ini mengarah pada diagnosis kerja Kejang Demam.",
      "category": "Penyakit Neurologis Anak"
    },
    {
      "id": 2,
      "name": "Hipertensi",
      "description": "Tekanan darah tinggi",
      "example": "Pemeriksaan fisik menunjukkan tekanan darah tinggi 160/100 mmHg, mengkonfirmasi diagnosis Hipertensi derajat 2.",
      "category": "Penyakit Kardiovaskular"
    },
    {
      "id": 3,
      "name": "Penyakit Jantung Hipertensi",
      "description": "Gangguan jantung akibat tekanan darah tinggi jangka panjang",
      "example": "Hasil Ekokardiogram menunjukkan adanya Hipertrofi ventrikel kiri, temuan klinis yang khas untuk Penyakit Jantung Hipertensi.",
      "category": "Penyakit Kardiovaskular"
    },
    {
      "id": 4,
      "name": "Gastroenteritis dan Kolitis",
      "description": "Peradangan pada lambung, usus, dan usus besar",
      "example": "Pasien mengeluhkan diare cair lebih dari 10 kali sehari, mengarah pada diagnosis kerja Gastroenteritis dan Kolitis akut.",
      "category": "Penyakit Pencernaan"
    },
    {
      "id": 5,
      "name": "Bronkitis",
      "description": "Peradangan pada saluran udara (bronkus)",
      "example": "Auskultasi paru menunjukkan adanya ronki basah kasar di kedua lapang paru, yang konsisten dengan diagnosis klinis Bronkitis akut pada pasien perokok berat ini.",
      "category": "Penyakit Pernapasan"
    },
    {
      "id": 6,
      "name": "Asma",
      "description": "Penyakit peradangan kronis pada saluran napas",
      "example": "Pasien datang dengan keluhan sesak napas dan Mengi yang memburuk pada malam hari, sebuah presentasi klinis klasik dari eksaserbasi Asma.",
      "category": "Penyakit Pernapasan"
    },
    {
      "id": 7,
      "name": "Diabetes Mellitus Tipe 2",
      "description": "Penyakit gula yang tidak tergantung pada insulin",
      "example": "Hasil laboratorium menunjukkan Hiperglikemia persisten, mengkonfirmasi diagnosis Diabetes Mellitus Tipe 2 yang memerlukan penatalaksanaan diet dan antidiabetik oral.",
      "category": "Penyakit Endokrin & Metabolik"
    },
    {
      "id": 8,
      "name": "Infeksi Saluran Kemih (ISK)",
      "description": "Infeksi yang terjadi di sistem perkemihan",
      "example": "Analisis Tes urine menunjukkan bakteriuria signifikan, yang mendukung diagnosis Infeksi Saluran Kemih (ISK) bagian bawah atau Sistitis.",
      "category": "Penyakit Infeksi"
    },
    {
      "id": 9,
      "name": "Faringitis Akut",
      "description": "Radang tenggorokan yang terjadi secara mendadak",
      "example": "Pemeriksaan orofaring menunjukkan hiperemia dan edema pada dinding faring posterior tanpa eksudat, sesuai dengan gambaran Faringitis Akut.",
      "category": "Penyakit THT"
    },
    {
      "id": 10,
      "name": "Penyakit Paru Obstruktif Kronis (PPOK)",
      "description": "Penyakit paru kronis yang menghambat aliran udara",
      "example": "Pasien dengan riwayat merokok datang dengan dispnea progresif dan hasil Spirometri menunjukkan Obstruksi aliran udara, mengkonfirmasi Penyakit Paru Obstruktif Kronis (PPOK).",
      "category": "Penyakit Pernapasan"
    },
    {
      "id": 11,
      "name": "Infeksi Saluran Pernapasan Akut (ISPA)",
      "description": "Infeksi mendadak pada saluran napas atas atau bawah",
      "example": "Gejala klinis berupa demam, batuk, dan Rinorea mengarah pada diagnosis Infeksi Saluran Pernapasan Akut (ISPA) dengan etiologi viral.",
      "category": "Penyakit Infeksi"
    },
    {
      "id": 12,
      "name": "Demam Berdarah Dengue (DBD)",
      "description": "Penyakit infeksi virus yang menular lewat nyamuk",
      "example": "Penurunan Trombosit yang progresif pada hari kelima demam sangat sugestif untuk Demam Berdarah Dengue (DBD).",
      "category": "Penyakit Infeksi"
    },
    {
      "id": 13,
      "name": "Sakit Perut",
      "description": "Rasa nyeri yang muncul di area antara tulang iga dan panggul",
      "example": "Pasien mengeluhkan Sakit Perut difus di kuadran kanan bawah disertai mual, memerlukan Ultrasonografi abdomen untuk evaluasi lebih lanjut.",
      "category": "Gejala Umum"
    },
    {
      "id": 14,
      "name": "Mual dan Muntah",
      "description": "Rasa tidak nyaman di perut dan pengeluaran isi lambung",
      "example": "Keluhan Mual dan Muntah persisten setelah makan mungkin mengindikasikan adanya Gastritis atau Obstruksi pada saluran cerna.",
      "category": "Gejala Umum"
    },
    {
      "id": 15,
      "name": "Dispepsia",
      "description": "Rasa tidak nyaman pada perut bagian atas karena masalah pencernaan",
      "example": "Sindrom Dispepsia fungsional didiagnosis setelah Endoskopi tidak menunjukkan kelainan struktural yang dapat menjelaskan keluhan Nyeri epigastrium pasien.",
      "category": "Penyakit Pencernaan"
    },
    {
      "id": 16,
      "name": "Gagal Jantung Kongestif",
      "description": "Kondisi saat jantung gagal memompa darah yang dibutuhkan tubuh",
      "example": "Pemeriksaan Sinar-X toraks menunjukkan kardiomegali dan efusi pleura bilateral, mendukung diagnosis klinis eksaserbasi akut Gagal Jantung Kongestif.",
      "category": "Penyakit Kardiovaskular"
    },
    {
      "id": 17,
      "name": "Bronkopneumonia",
      "description": "Jenis radang paru yang menyerang saluran dan kantung udara",
      "example": "Infiltrat multipel yang tersebar di kedua lobus bawah paru pada citra radiografi Toraks merupakan gambaran khas dari Bronkopneumonia.",
      "category": "Penyakit Pernapasan"
    },
    {
      "id": 18,
      "name": "Sakit Kepala",
      "description": "Rasa nyeri di kepala yang bisa muncul bertahap atau mendadak",
      "example": "Pasien melaporkan Sakit Kepala primer tipe tegang (Tension headache) yang bersifat bilateral dan menekan, tanpa disertai Fotopsia atau gejala neurologis fokal lainnya.",
      "category": "Gejala Umum"
    },
    {
      "id": 19,
      "name": "Pusing",
      "description": "Sensasi seperti melayang, berputar, atau akan pingsan",
      "example": "Episode Pusing berputar (Vertigo) yang dipicu oleh perubahan posisi kepala mengarahkan kecurigaan pada Benign Paroxysmal Positional Vertigo.",
      "category": "Gejala Umum"
    },
    {
      "id": 20,
      "name": "Demam Tifoid (Tipes)",
      "description": "Penyakit infeksi akibat bakteri Salmonella typhi",
      "example": "Hasil Kultur darah yang positif Salmonella typhi mengkonfirmasi diagnosis Demam Tifoid (Tipes) pada pasien dengan riwayat demam step-ladder.",
      "category": "Penyakit Infeksi"
    },
    {
      "id": 21,
      "name": "Nyeri Punggung Bawah",
      "description": "Rasa nyeri di pinggang yang bisa menjalar ke bokong dan paha",
      "example": "Anamnesis Nyeri Punggung Bawah (Lumbago) mekanik yang memburuk dengan aktivitas dan membaik dengan istirahat, tanpa adanya red flags, tidak memerlukan pencitraan segera.",
      "category": "Kondisi Muskuloskeletal"
    },
    {
      "id": 22,
      "name": "Stroke",
      "description": "Gangguan fungsi otak akibat terganggunya pasokan darah",
      "example": "Timbulnya gangguan fungsi otak secara mendadak akibat terganggunya pasokan darah ke otak mengindikasikan diagnosis klinis Stroke iskemik.",
      "category": "Penyakit Neurologis"
    },
    {
      "id": 23,
      "name": "Infark Serebral (Stroke Sumbatan)",
      "description": "Kematian sel otak akibat kekurangan oksigen karena sumbatan",
      "example": "Hasil CT scan kepala menunjukkan area hipodens pada teritori arteri serebri media kiri, mengkonfirmasi adanya Infark Serebral (Stroke Sumbatan) luas.",
      "category": "Penyakit Neurologis"
    },
    {
      "id": 24,
      "name": "Pneumonia (Radang Paru-paru)",
      "description": "Peradangan paru-paru akibat infeksi",
      "example": "Konsolidasi pada lobus kanan bawah paru yang terlihat pada Sinar-X dada, disertai demam tinggi dan batuk produktif, sangat sugestif untuk Pneumonia komunitas.",
      "category": "Penyakit Pernapasan"
    },
    {
      "id": 25,
      "name": "Kemoterapi",
      "description": "Pemberian obat untuk menghentikan pertumbuhan sel kanker",
      "example": "Pasien dijadwalkan untuk menjalani siklus pertama Kemoterapi adjuvan dengan regimen Alkylating agent untuk Karsinoma ovarium stadium III.",
      "category": "Prosedur Medis"
    },
    {
      "id": 26,
      "name": "Konjungtivitis",
      "description": "Mata merah akibat peradangan pada selaput mata",
      "example": "Injeksi Konjungtiva bilateral dengan Ocular discharge mukopurulen pada pemeriksaan mata mengindikasikan Konjungtivitis bakterialis.",
      "category": "Penyakit Mata"
    },
    {
      "id": 27,
      "name": "Karies Gigi",
      "description": "Kerusakan lapisan struktur gigi secara bertahap",
      "example": "Pemeriksaan intraoral menunjukkan adanya Karies Gigi profunda pada molar pertama kanan bawah yang telah mencapai Pulpa.",
      "category": "Kesehatan Gigi & Mulut"
    },
    {
      "id": 28,
      "name": "Rehabilitasi Medik",
      "description": "Terapi untuk memulihkan fungsi tubuh yang bermasalah",
      "example": "Pasien pasca-stroke dirujuk ke departemen Rehabilitasi Medik untuk program Fisioterapi guna memulihkan fungsi motorik secara komprehensif.",
      "category": "Prosedur Medis"
    },
    {
      "id": 29,
      "name": "Katarak",
      "description": "Gangguan penglihatan akibat keruhnya lensa mata",
      "example": "Visus pasien menurun menjadi 6/60 yang tidak membaik dengan koreksi pinhole, disebabkan oleh Katarak nuklir matur yang memerlukan tindakan Extracapsular surgery.",
      "category": "Penyakit Mata"
    },
    {
      "id": 30,
      "name": "Gigi Impaksi",
      "description": "Kondisi gigi yang tidak dapat keluar dengan normal",
      "example": "Gambaran radiografi panoramik menunjukkan Gigi Impaksi molar ketiga kiri bawah dalam posisi mesioangular yang menyebabkan Perikoronitis berulang.",
      "category": "Kesehatan Gigi & Mulut"
    },
    {
      "id": 31,
      "name": "Malaise dan Kelelahan",
      "description": "Perasaan lelah dan tidak nyaman tanpa penyebab jelas",
      "example": "Pasien melaporkan keluhan non-spesifik berupa Malaise dan Kelelahan (Fatigue) selama dua minggu terakhir, yang merupakan gejala prodromal umum dari berbagai penyakit sistemik.",
      "category": "Gejala Umum"
    },
    {
      "id": 32,
      "name": "Myalgia (Nyeri Otot)",
      "description": "Rasa sakit atau tidak nyaman pada otot",
      "example": "Keluhan Myalgia difus yang disertai demam dan Sakit kepala seringkali berasosiasi dengan infeksi virus sistemik seperti influenza.",
      "category": "Gejala Umum"
    },
    {
      "id": 33,
      "name": "Hiperemesis Gravidarum",
      "description": "Mual dan muntah berlebihan selama kehamilan",
      "example": "Pasien G1P0A0 pada usia Kehamilan 10 minggu dirawat inap dengan diagnosis Hiperemesis Gravidarum akibat Dehidrasi dan adanya Keton pada Tes urine.",
      "category": "Kondisi Terkait Kehamilan"
    },
    {
      "id": 34,
      "name": "GERD (Penyakit Asam Lambung)",
      "description": "Kondisi saat asam lambung naik ke kerongkongsn",
      "example": "Keluhan Nyeri epigastrium seperti terbakar (heartburn) yang memburuk saat berbaring merupakan gejala kardinal dari GERD (Penyakit Asam Lambung).",
      "category": "Penyakit Pencernaan"
    },
    {
      "id": 35,
      "name": "Gagal Ginjal Kronis",
      "description": "Penurunan fungsi ginjal secara bertahap",
      "example": "Pasien dengan Gagal Ginjal Kronis stadium V (eLFG < 15 ml/menit) kini memerlukan terapi pengganti ginjal berupa Dialisis rutin.",
      "category": "Penyakit Ginjal"
    },
    {
      "id": 36,
      "name": "Dermatitis Atopik",
      "description": "Peradangan kulit kronis yang gatal dan kering",
      "example": "Lesi ekzematosa yang gatal pada fosa antekubiti dan poplitea dengan riwayat atopi pada keluarga sangat mendukung diagnosis Dermatitis Atopik.",
      "category": "Penyakit Kulit"
    },
    {
      "id": 37,
      "name": "Penyakit Jantung Aterosklerotik",
      "description": "Penyempitan pembuluh darah jantung akibat penumpukan plak",
      "example": "Angina pektoris stabil pada pasien ini disebabkan oleh stenosis signifikan arteri koroner akibat Penyakit Jantung Aterosklerotik dengan Aterosklerosis.",
      "category": "Penyakit Kardiovaskular"
    },
    {
      "id": 38,
      "name": "Tonsilitis",
      "description": "Peradangan pada amandel",
      "example": "Pemeriksaan fisik menunjukkan tonsil hiperemis dan kripta yang melebar dengan detritus, konsisten dengan Tonsilitis kronis eksaserbasi akut yang memerlukan Tonsilektomi.",
      "category": "Penyakit THT"
    },
    {
      "id": 39,
      "name": "Pulpitis",
      "description": "Peradangan pada pulpa gigi",
      "example": "Pasien mengeluhkan nyeri gigi spontan dan berdenyut yang mengganggu tidur, sebuah gejala khas dari Pulpitis ireversibel yang memerlukan perawatan saluran akar.",
      "category": "Kesehatan Gigi & Mulut"
    },
    {
      "id": 40,
      "name": "Tuberkulosis Paru (TBC)",
      "description": "Infeksi bakteri kronis pada paru-paru",
      "example": "Hasil pemeriksaan BTA sputum positif tiga kali memastikan diagnosis Tuberkulosis Paru (TBC) aktif dan pasien akan memulai terapi OAT kategori 1.",
      "category": "Penyakit Infeksi"
    },
    {
      "id": 41,
      "name": "Kehamilan",
      "description": "Periode perkembangan janin dalam rahim",
      "example": "Pemeriksaan Ultrasonografi transvaginal mengkonfirmasi adanya kantung gestasi intrauterin dengan denyut jantung Janin, sesuai dengan status Kehamilan 7 minggu.",
      "category": "Kondisi Terkait Kehamilan"
    }
  ]
}